{
  "name": "Ataque de Fuerza Bruta",
  "nodes": [
    {
      "id": "actor",
      "type": "actor",
      "name": "Atacante",
      "description": "Un individuo o grupo con intenciones maliciosas que intenta obtener acceso no autorizado a sistemas o cuentas mediante la prueba sistemática de combinaciones de contraseñas.",
      "threats": [
        {
          "name": "Suplantación de Identidad",
          "description": "El atacante intenta hacerse pasar por un usuario legítimo para obtener acceso a sistemas.",
          "mitigations": [
            {
              "name": "Autenticación Multifactor (MFA)",
              "description": "Requiere múltiples formas de verificación para acceder a las cuentas."
            },
            {
              "name": "Política de Contraseñas Fuertes",
              "description": "Exigir el uso de contraseñas complejas y únicas."
            }
          ]
        },
        {
          "name": "Acceso No Autorizado",
          "description": "Uso de contraseñas adivinadas para acceder a cuentas o sistemas.",
          "mitigations": [
            {
              "name": "Bloqueo de Cuenta",
              "description": "Implementar bloqueos temporales de cuenta después de un número determinado de intentos fallidos."
            },
            {
              "name": "Monitoreo de Intentos de Acceso",
              "description": "Monitorear y alertar sobre intentos de acceso repetidos y fallidos."
            }
          ]
        }
      ]
    },
    {
      "id": "process",
      "type": "process",
      "name": "Ataque de Fuerza Bruta",
      "description": "Método de ataque en el que el atacante intenta acceder a una cuenta o sistema mediante la prueba repetitiva de contraseñas o claves hasta encontrar la correcta.",
      "threats": [
        {
          "name": "Enumeración de Contraseñas",
          "description": "El atacante prueba combinaciones de contraseñas hasta encontrar la correcta.",
          "mitigations": [
            {
              "name": "Política de Contraseñas",
              "description": "Aplicar reglas estrictas para la complejidad de contraseñas y el cambio periódico."
            },
            {
              "name": "Uso de Captchas",
              "description": "Implementar captchas en formularios de inicio de sesión para prevenir ataques automatizados."
            }
          ]
        },
        {
          "name": "Ataques Automatizados",
          "description": "Utilización de herramientas automatizadas para intentar múltiples combinaciones de contraseñas rápidamente.",
          "mitigations": [
            {
              "name": "Rate Limiting",
              "description": "Limitar la cantidad de intentos de inicio de sesión permitidos desde una sola dirección IP en un período de tiempo."
            },
            {
              "name": "Sistema de Alerta",
              "description": "Configurar alertas para detectar patrones inusuales en los intentos de inicio de sesión."
            }
          ]
        }
      ]
    },
    {
      "id": "consequence",
      "type": "consequence",
      "name": "Acceso No Autorizado",
      "description": "El atacante obtiene acceso a cuentas o sistemas sin permiso, lo que puede resultar en la exposición de datos sensibles y el control no autorizado sobre sistemas críticos.",
      "threats": [
        {
          "name": "Robo de Datos Sensibles",
          "description": "Acceso a datos confidenciales almacenados en el sistema comprometido.",
          "mitigations": [
            {
              "name": "Encriptación de Datos",
              "description": "Asegurar que todos los datos sensibles estén encriptados."
            },
            {
              "name": "Seguridad de Datos",
              "description": "Implementar medidas de seguridad adicionales para proteger la información sensible."
            }
          ]
        },
        {
          "name": "Interrupción de Servicios",
          "description": "El acceso no autorizado puede llevar a la alteración o interrupción de servicios críticos.",
          "mitigations": [
            {
              "name": "Control de Acceso",
              "description": "Restringir el acceso a servicios críticos a usuarios autorizados solamente."
            },
            {
              "name": "Plan de Respuesta a Incidentes",
              "description": "Establecer un plan para manejar la interrupción de servicios y restaurar la operación normal."
            }
          ]
        }
      ]
    },
    {
      "id": "asset",
      "type": "asset",
      "name": "Credenciales de Usuario",
      "description": "Información de autenticación que puede ser comprometida durante el ataque de fuerza bruta."
    },
    {
      "id": "asset",
      "type": "asset",
      "name": "Sistemas de Autenticación",
      "description": "Componentes del sistema que gestionan el proceso de inicio de sesión y autenticación."
    },
    {
      "id": "asset",
      "type": "asset",
      "name": "Datos Sensibles",
      "description": "Información valiosa que puede ser expuesta o comprometida si el atacante obtiene acceso no autorizado."
    }
  ],
  "links": [
    {
      "source": "actor",
      "target": "process"
    },
    {
      "source": "process",
      "target": "consequence"
    },
    {
      "source": "process",
      "target": "asset"
    },
    {
      "source": "consequence",
      "target": "asset"
    }
  ]
}
